Tekla.Structures.DialogInternal.SettingsUnitType_e.Millimeter
The millimeter unit type.

Tekla.Structures.DialogInternal.SettingsUnitType_e.Centimeter
The centimeter unit type.

Tekla.Structures.DialogInternal.SettingsUnitType_e.Meter
The meter unit type.

Tekla.Structures.DialogInternal.SettingsUnitType_e.Inch
The inch unit type.

Tekla.Structures.DialogInternal.SettingsUnitType_e.Foot
The foot unit type.

Tekla.Structures.DialogInternal.SettingsUnitType_e.Fractional
The foot and inch fractional unit type.